/*********************************************************************************************************
* 模块名称：os_sem.c
* 摘    要：信号量组件
* 当前版本：1.0.0
* 作    者：Chill
* 完成日期：2026年01月23日
* 内    容：
*           (1) 本模块实现计数型信号量（可用于二值信号量与计数信号量）。
*              - count 表示当前可用资源数量
*              - countMax 表示信号量允许的最大计数值（防止无限增长）
*
*           (2) 信号量对象内部维护一个挂起链表 pendList：
*              - 当任务调用 OSSemPend() 且 count==0 时，任务进入 pendList 挂起等待
*              - 当其他任务/中断调用 OSSemPost() 时，若 pendList 非空，则直接唤醒
*                pendList 中优先级最高的任务，而不是增加 count
*
*           (3) OSSemPost() 的优先级策略：
*              - pendList 非空：优先唤醒等待者（资源直接交付给任务）
*              - pendList 为空：才增加 count（资源入库）
*
*           (4) 临界区保护：
*              - 本模块对 pendList / count / 任务状态切换均处于临界区内完成
*              - 防止任务并发或中断抢占导致链表损坏或计数错误
*
*           (5) 调度时机：
*              - OSSemPost() 和 OSSemDelete() 在退出临界区后调用 OS_Sched()
*                以便立即让更高优先级任务得到运行机会
*              - OSSemPend() 在挂起当前任务后调用 OS_Sched() 切换到其他任务
*
*           (6) 中断调用注意事项：
*							 - 只允许在中断临界区 OSIntEnTer() 和 OSIntExit() 内调用 OSSemPost()
*							 - 不允许在中断内调用 OSSemPend()
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "CasyOS.h"

#if OS_CFG_SEM_EN != 0
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
extern OS_TASK_HANDLE* volatile g_pCurrentTask;
extern volatile u8 g_OSIntNestCnt;
extern volatile u8 g_OSSchedFlag;

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：
* 函数功能：
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月23日
* 注    意：
*********************************************************************************************************/


/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：OS_SemInit
* 函数功能：创建信号量并初始化
* 输入参数：p_sem: 信号量指针 p_name: 信号量字符串 countMax: 设置信号量最大计数值
* 输出参数：g_pCurrentTask：优先级最高的任务句柄
* 返 回 值：void
* 创建日期：2026年01月23日
* 注    意：
*           (1) 初始化时信号量计数值 count = 0
*           (2) pendList 会被初始化为空链表
*           (3) countMax 用于防止 OSSemPost() 导致计数溢出
*********************************************************************************************************/
void OS_SemInit(OS_SEM *p_sem, u32 countMax)
{
	if(p_sem == NULL)
	{
		printf("ERROR:[OS_SemInit] Illegal argument!\r\n");
		return;
	}
	
	p_sem->objType = OS_OBJ_TYPE_SEM;
	OS_PendListInit(&p_sem->pendList);
	p_sem->count = 0;
	p_sem->countMax = countMax;
}

/*********************************************************************************************************
* 函数名称：OSSemPost
* 函数功能：释放信号量
* 输入参数：p_sem: 信号量指针 p_name: 信号量字符串 count: 设置信号量最大计数值
* 输出参数：g_pCurrentTask：优先级最高的任务句柄
* 返 回 值：void
* 创建日期：2026年01月23日
* 注    意：
*           (1) 若 pendList 为空：count++（资源入库），但不会超过 countMax
*           (2) 若 pendList 非空：直接唤醒优先级最高的等待任务（资源直接交付）
*           (3) 函数退出后调用 OS_Sched()，确保更高优先级任务能立即运行
*           (4) 本函数涉及任务状态修改与链表操作，必须在临界区内完成
*********************************************************************************************************/
void OSSemPost(OS_SEM *p_sem)
{
	OS_TASK_HANDLE *p_tcb;
	OS_PEND_LIST *p_pend_list;
	
	OS_ENTER_CRITICAL();
	
	//信号量为空或无效
	if(p_sem == NULL)
	{
		printf("ERROR:[OSSemPost] Illegal argument!\r\n");
		OS_EXIT_CRITICAL();
		return;
	}
	if(p_sem->objType != OS_OBJ_TYPE_SEM)
	{
		printf("ERROR:[OSSemPost] Invaild Semapore!\r\n");
		OS_EXIT_CRITICAL();
		return;
	}
	
	p_pend_list = &p_sem->pendList;
	if(p_pend_list->headPtr == NULL)	//如果挂起列表里面没有任务
	{
		if(p_sem->count >= p_sem->countMax)	//如果信号量已经达到最大值
		{
			printf("Warning:[OSSemPost] Semapore is FULL!\r\n");
		}
		else
		{
			p_sem->count++;
		}
	}
	else	//有任务 直接交给优先级最高的
	{
		p_tcb = OS_PendListGetHighest(p_pend_list);
		OS_PendListRemove(p_pend_list, p_tcb);
		OS_RdyTaskAdd(p_tcb);
		p_tcb->state = OS_TASK_READY;
		p_tcb->pendObj = (void*)NULL;
	}
	
	OS_EXIT_CRITICAL();
	OS_Sched();
}

/*********************************************************************************************************
* 函数名称：OSSemPend
* 函数功能：挂起等待信号量
* 输入参数：p_sem: 信号量指针 p_name: 信号量字符串 count: 设置信号量最大计数值
* 输出参数：g_pCurrentTask：优先级最高的任务句柄
* 返 回 值：void
* 创建日期：2026年01月23日
* 注    意：
*           (1) 若 count > 0：说明资源可用，count-- 后直接返回（不挂起）
*           (2) 若 count == 0：当前任务进入 pendList 挂起等待，并触发调度
*           (3) 当前任务挂起时会：
*              - 从就绪列表移除 OS_RdyTaskRemove()
*              - 插入信号量挂起列表 OS_PendListInsert()
*              - state 设置为 OS_TASK_PEND
*              - pendObj 指向该信号量对象
*           (4) TODO: 本函数不带超时机制，如需超时等待应扩展 tick 相关逻辑
*********************************************************************************************************/
void OSSemPend(OS_SEM *p_sem)
{
	OS_ENTER_CRITICAL();
	
	if(p_sem == NULL)	//信号量为空
	{
		printf("ERROR:[OSSemPend] Illegal argument!\r\n");
		OS_EXIT_CRITICAL();
		return;
	}
	if(p_sem->objType != OS_OBJ_TYPE_SEM)
	{
		printf("ERROR:[OSSemPend] Invaild Semapore!\r\n");
		OS_EXIT_CRITICAL();
		return;
	}
	
	//如果信号量有资源可用 可以直接返回
	if(p_sem->count > 0)
	{
		p_sem->count--;
		OS_EXIT_CRITICAL();
		return;
	}
	else	//没有可用的资源 挂起任务等待
	{
		OS_RdyTaskRemove(g_pCurrentTask);
		OS_PendListInsert(&p_sem->pendList, g_pCurrentTask);
		g_pCurrentTask->state = OS_TASK_PEND;
		g_pCurrentTask->pendObj = (void*)p_sem;
	}
	
	//挂起任务
	OS_EXIT_CRITICAL();
	OS_Sched();
}

#endif	//OS_CFG_SEM_EN

