/*********************************************************************************************************
* 模块名称: GeneralQueue.h
* 摘    要:
* 当前版本: 1.0.0
* 作    者: Chill
* 完成日期: 2026年01月31日
* 内    容:
* 注    意: none
**********************************************************************************************************
* 取代版本:
* 作    者:
* 完成日期:
* 修改内容:
* 修改文件:
*********************************************************************************************************/
#ifndef _GENERAL_QUEUE_H_
#define _GENERAL_QUEUE_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "stdio.h"
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
typedef struct
{
  u32   front;        //头指针，队非空时指向队头元素
  u32   rear;         //尾指针，队非空时指向队尾元素的下一个位置
  u32   bufLen;       //队列的总容量
  u32   elemNum;      //当前队列中的元素的数量
  u32   typeSize;     //数据类型字节总数
  void* buf;          //数据缓冲区，由动态内存分配
}StructGeneralCirQue; //通用循环队列

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  InitGeneralQueue(StructGeneralCirQue* queue);
int   IsGeneralQueueEmpty(StructGeneralCirQue* queue);
int   IsGeneralQueueFull(StructGeneralCirQue* queue);
void  ClearGeneralQueue(StructGeneralCirQue* queue);
u32   GetrGeneralQueueLength(StructGeneralCirQue* queue);
void  EnGeneralQueue(StructGeneralCirQue* queue, void* data);
void* DeGeneralQueue(StructGeneralCirQue* queue);

#endif
