/*********************************************************************************************************
* 模块名称：CasyOS.c
* 摘    要：轻量级简易RTOS核心
* 当前版本：1.0.0
* 作    者：Chill
* 完成日期：2026年01月31日
* 内    容：
*           (1) RTOS内核核心：调度触发、任务切换、中断嵌套管理
*           (2) 异常入口：SysTick / SVC / PendSV
*           (3) 提供系统启动、临界区管理、延时等基础接口
* 注    意：
*           (1) 此文件一般不允许用户修改
*           (2) 任务切换依赖 PendSV 异常，首次启动依赖 SVC 异常
*           (3) SysTick 作为系统节拍时钟（OS Tick），频率影响延时精度与调度开销
*						(4) 全部任务和中断都仅使用MSP主栈指针 尚未实现PSP任务栈
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "CasyOS.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define PENDSV_TRIGGER (*(u32*)0xE000ED04 |= 0x10000000)	//触发PENDSV异常 立刻调度任务
#define OS_MAX_TIME (u64)(0xFFFFFFFFFFFFFFFF)	//最大延时时间，使用64位计时，每隔1ms计时一次
#define OS_MAX_TASK (u32)(10)	//最大任务数量，含空闲任务

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
//全局变量
OS_TASK_HANDLE* volatile g_pCurrentTask = NULL;	//当前正在执行的任务句柄
volatile u8 g_OSIntNestCnt = 0;									//中断嵌套计数(>0 表示处于中断上下文)
volatile u8 g_OSSchedFlag = 0;									//是否需要触发任务切换标志(1表示需要触发一次任务切换)

//静态变量
static u32 s_arrIdleStack[64];									//空闲任务栈
static OS_TASK_HANDLE s_structIdleHandle;				//空闲任务句柄

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void IdleTask(void);	//空闲任务

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：IdleTask
* 函数功能：空闲任务
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：
*           (1) 空闲任务用于保证系统始终有任务可运行
*           (2) TODO: 可在此处扩展 CPU 利用率统计 / 低功耗处理等功能
*********************************************************************************************************/
static void IdleTask(void)
{
	while(1)
	{
		
	} 
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：OS_Sched
* 函数功能：更新当前任务句柄到任务优先级最高的任务
* 输入参数：void
* 输出参数：g_pCurrentTask：优先级最高的任务句柄
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：
*           (1) 任务态调用：立即触发 PendSV 异常进行切换
*           (2) 中断态调用：仅置位 g_OSSchedFlag，由 OSIntExit 统一触发 PendSV
*           (3) 非用户接口，仅供内核模块使用
*********************************************************************************************************/
void OS_Sched(void)
{
	g_OSSchedFlag = 1;
	if(OS_InISR() == 0)
	{
		PENDSV_TRIGGER;
	}
}

/*********************************************************************************************************
* 函数名称：SysTick_Handler
* 函数功能：SysTick中断服务函数
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：
*           (1) 该函数由中断向量表引用，不能声明为 static
*           (2) SysTick 为操作系统主时钟，用于维护任务延时与时间片等机制
*           (3) 中断内不直接切换任务，而是触发调度请求
*********************************************************************************************************/
void SysTick_Handler(void)
{
	OSIntEnter();
	OS_TickUpdate();	//所有任务tick递减 空闲任务除外

	OS_Sched();				//触发异常 任务切换
	OSIntExit();
}

/*********************************************************************************************************
* 函数名称：SVC_Handler
* 函数功能：SVC_Handler中断服务函数
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：
*           (1) 该函数由中断向量表引用，不能声明为 static
*           (2) 主要用于系统首次启动时恢复第一个任务上下文
*           (3) 该实现依赖 OS_UpdateCurrentTask() 选出最高优先级就绪任务
*********************************************************************************************************/
__ASM void SVC_Handler(void)
{
	PRESERVE8                		//该段起始地址以8字节对齐
	IMPORT OS_UpdateCurrentTask //引入标号OS_UpdateCurrentTask
	IMPORT g_pCurrentTask    		//引入标号g_pCurrentTask

	//屏蔽所有中断
	CPSID F
	
	//查找优先级最高的任务，更新到g_pCurrentTask
	BL OS_UpdateCurrentTask
	
	//恢复第一个任务栈区指针(结构体第一个成员变量即为栈区指针)
	LDR R4,= g_pCurrentTask  //获取g_pCurrentTask的地址，保存到R4
	LDR R5, [R4]             //获取g_pCurrentTask的内容，即当前任务句柄首地址，保存到R5
	LDR SP, [R5]             //获取任务句柄首地址4字节数据，保存到栈区指针中
	
	//恢复第一个任务预设的现场数据
	POP{R4-R11}              //恢复R4-R11
#if OS_CFG_FPU_EN != 0
	VPOP{S16-S31}            //恢复S16-S31
#endif
	POP{LR}                  //恢复LR
	
	//取消屏蔽中断
	CPSIE F
	
	//从异常中退出
	BX LR
	NOP
}

/*********************************************************************************************************
* 函数名称: PendSV_Handler
* 函数功能: PendSV中断服务函数，实现任务切换
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2026年01月31日
* 注    意: 
*           (1) 任务中使用的也是MSP，PendSV_Handler被中断向量表引用，不能设为内部函数
*           (2) PendSV 具有最低优先级，适合用于任务切换
*           (3) Cortex-M 硬件自动保存 R0-R3、R12、LR、PC、xPSR，本函数保存其余寄存器
*********************************************************************************************************/
__ASM void PendSV_Handler(void)
{
  PRESERVE8                			//该段起始地址以8字节对齐
  IMPORT OS_UpdateCurrentTask		//引入标号OS_UpdateCurrentTask
  IMPORT g_pCurrentTask    			//引入标号g_pCurrentTask

  //屏蔽所有中断
  CPSID F

  //保存当前任务现场数据(xPSR、PC、LR、R12以及R3~R0已经自动保存)
  PUSH{LR}                 //保存LR到栈区中
#if OS_CFG_FPU_EN != 0
  VPUSH{S16-S31}           //保存S16-S31到栈区中
#endif
  PUSH{R4-R11}             //保存R4-R11到栈区中

  //保存当前任务栈区指针(结构体第一个成员变量即为栈区指针)
  LDR R4,= g_pCurrentTask  //获取g_pCurrentTask的地址，保存到R4
  LDR R5, [R4]             //获取g_pCurrentTask的内容，即当前任务句柄首地址，保存到R5
  STR SP, [R5]             //将栈 区指针按字保存到任务句柄起始位置，即OS_TASK_HANDLE结构体第一个成员变量
  
  //更新所有任务时间和查找优先级最高的任务
  BL OS_UpdateCurrentTask

  //恢复下一个任务栈区指针(结构体第一个成员变量即为栈区指针)
  LDR R4,= g_pCurrentTask  //获取g_pCurrentTask的地址，保存到R4
  LDR R5, [R4]             //获取g_pCurrentTask的内容，即当前任务句柄首地址，保存到R5
  LDR SP, [R5]             //获取任务句柄首地址4字节数据，保存到栈区指针中
  
  //恢复下一个任务现场数据
  POP{R4-R11}              //恢复R4-R11
#if OS_CFG_FPU_EN != 0
  VPOP{S16-S31}            //恢复S16-S31
#endif
  POP{LR}                  //恢复LR

  //取消屏蔽中断
  CPSIE F 

  //从异常中退出
  BX LR
}

/*********************************************************************************************************
* 函数名称：InitCasyOS
* 函数功能：注册任务
* 输入参数：	p_tcb   : 任务控制块指针
*           func    : 任务入口函数指针
*           p_name  : 任务名称字符串
*           prio    : 任务优先级（数值越小优先级越高）
*           stkBase : 栈底地址（栈数组首地址）
*           stkSize : 栈大小（单位：u32 个数）
*           semSize : 内建信号量初始计数值（可选）
*           queSize : 内建消息队列深度（可选）
* 输出参数：void
* 返 回 值：0-成功，其它-失败
* 创建日期：2026年01月31日
* 注    意：要求用户在上电时 启动系统之前调用该函数进行初始化
*********************************************************************************************************/
void InitCasyOS(void)
{
	OSInitMemory();			//初始化CasyOS内存管理模块
	OSInitTaskSched();	//初始化CasyOS任务调度模块
}

/*********************************************************************************************************
* 函数名称：OSRegister
* 函数功能：注册任务
* 输入参数：	p_tcb   : 任务控制块指针
*           func    : 任务入口函数指针
*           p_name  : 任务名称字符串
*           prio    : 任务优先级（数值越小优先级越高）
*           stkBase : 栈底地址（栈数组首地址）
*           stkSize : 栈大小（单位：u32 个数）
*           semSize : 内建信号量初始计数值（可选）
*           queSize : 内建消息队列深度（可选）
* 输出参数：void
* 返 回 值：0-成功，其它-失败
* 创建日期：2026年01月31日
* 注    意：注册任务数量不能大于OS_MAX_TASK
*********************************************************************************************************/
u32 OSRegister(OS_TASK_HANDLE* p_tcb, void* func, char *p_name, u32 prio, u32* stkBase, u32 stkSize, u32 semSize, u32 queSize)
{
  u32  i;   //循环变量
  u32* top; //栈顶地址
  
	//参数默认填充
	p_tcb->stackBase = stkBase;
	p_tcb->stackSize = stkSize;
	p_tcb->func      = (void (*)(void *))func;
	p_tcb->taskName      = p_name;
	p_tcb->priority      = prio;
	p_tcb->tick = 0;
	p_tcb->rdyNextPtr = NULL;
	p_tcb->rdyPrevPtr = NULL;
	p_tcb->tickNextPtr = NULL;
	p_tcb->tickPrevPtr = NULL;
	
  //栈区清零
  for(i = 0; i < stkSize; i++)
  {
    p_tcb->stackBase[i] = 0;
  }

	//获取栈顶并8字节对齐
	top = (u32*)(p_tcb->stackBase + p_tcb->stackSize); 
	top = (u32*)((u32)top & ~0x07);

	/*--------硬件自动恢复区--------*/
	*(--top) = 0x01000000;          //xPSR
	*(--top) = (u32)p_tcb->func;    //PC
	*(--top) = 0xFFFFFFFEUL;        //LR（非法返回）
	*(--top) = 0x12121212;          //R12
	*(--top) = 0x03030303;          //R3
	*(--top) = 0x02020202;          //R2
	*(--top) = 0x01010101;          //R1
	*(--top) = 0x00000000;          //R0

	/*----------软件保存区---------*/
	*(--top) = 0xFFFFFFF9UL;        //EXC_RETURN

#if OS_CFG_FPU_EN != 0
	for(i = 0; i < 16; i++)
	{
		*(--top) = 0;
	}
#endif

	*(--top) = 0x11111111;          //R11
	*(--top) = 0x10101010;          //R10
	*(--top) = 0x09090909;          //R9
	*(--top) = 0x08080808;          //R8
	*(--top) = 0x07070707;          //R7
	*(--top) = 0x06060606;          //R6
	*(--top) = 0x05050505;          //R5
	*(--top) = 0x04040404;          //R4

	p_tcb->stackTop = top;

	OS_TaskListAdd(p_tcb);				//加入到全局任务单链表
#if OS_CFG_SEM_EN != 0
	OS_SemInit(&p_tcb->sem, semSize);	//初始化内建信号量
#endif
#if OS_CFG_Q_EN != 0
	OS_QInit(p_tcb, queSize);			//初始化内建消息队列
#endif
	OS_RdyTaskAdd(p_tcb);					//加入到就绪列表并更新优先级位图

  return 0;	//创建成功
}

/*********************************************************************************************************
* 函数名称：OSStart
* 函数功能：开启操作系统
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：这里可以修改系统时钟频率
*********************************************************************************************************/
void OSStart(void)
{
  SCB->CCR |= SCB_CCR_STKALIGN_Msk;        //使能双字栈对齐特性
  OSRegister(&s_structIdleHandle, IdleTask, "IdleTask", OS_CFG_PRIO_MAX-1, s_arrIdleStack, sizeof(s_arrIdleStack)/4, 0, 0);	//注册空闲任务
  SysTick_Config(SystemCoreClock / 1000U); //配置系统滴答定时器1ms中断一次
  NVIC_SetPriority(SysTick_IRQn, 0x00U);   //设置SysTick优先级
  NVIC_SetPriority(SVCall_IRQn, 0x01U);    //设置SVC的优先级
  NVIC_SetPriority(PendSV_IRQn, 0xFFU);    //设置PendSV的优先级，最小优先级
  __ASM("SVC #0x03");                      //启动第一个任务
}

/*********************************************************************************************************
* 函数名称：OS_ENTER_CRITICAL
* 函数功能：进入临界区
* 输入参数：time：延时时长，ms
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：尚不支持嵌套
*********************************************************************************************************/
void OS_ENTER_CRITICAL(void)
{
	__disable_irq();
}

/*********************************************************************************************************
* 函数名称：OS_EXIT_CRITICAL
* 函数功能：退出临界区
* 输入参数：time：延时时长，ms
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：尚不支持嵌套
*********************************************************************************************************/
void OS_EXIT_CRITICAL(void)
{
	__enable_irq();
}

/*********************************************************************************************************
* 函数名称：OS_InISR
* 函数功能：判断是否处于中断中
* 输入参数：time：延时时长，ms
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：非用户调用 内核其他部分使用
*********************************************************************************************************/
u8 OS_InISR(void)
{
	return (g_OSIntNestCnt > 0);
}

/*********************************************************************************************************
* 函数名称：OSIntEnter
* 函数功能：进入中断
* 输入参数：time：延时时长，ms
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：要求用户在进入中断时调用 支持嵌套
*********************************************************************************************************/
void OSIntEnter(void)
{
	OS_ENTER_CRITICAL();
	g_OSIntNestCnt++;
	OS_EXIT_CRITICAL();
}

/*********************************************************************************************************
* 函数名称：OSIntExit
* 函数功能：退出中断
* 输入参数：time：延时时长，ms
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：要求用户在退出中断时调用 支持嵌套
*********************************************************************************************************/
void OSIntExit(void)
{
	OS_ENTER_CRITICAL();
	g_OSIntNestCnt--;
	if (g_OSIntNestCnt == 0 && g_OSSchedFlag == 1)
	{
		g_OSSchedFlag = 0;
		PENDSV_TRIGGER;
	}
	OS_EXIT_CRITICAL();
}

/*********************************************************************************************************
* 函数名称：OSDelay
* 函数功能：任务延时
* 输入参数：time：延时时长，ms
* 输出参数：void
* 返 回 值：void
* 创建日期：2026年01月31日
* 注    意：不允许在中断中调用
*********************************************************************************************************/
void OSDelay(u32 time)
{
	if(g_pCurrentTask == &s_structIdleHandle) 
	{
		printf("Warning: Try to Delay IdleTask!\r\n");
		return;
	}
	
  __set_BASEPRI(1);            //关中断
	g_pCurrentTask->tick = time;
	OS_RdyTaskRemove(g_pCurrentTask);		//移出就绪列表
	OS_TickTaskInsert(g_pCurrentTask, time);	//加入延时列表
  __set_BASEPRI(0);            //开中断
  PENDSV_TRIGGER;              //触发任务切换
}
